fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции  

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Акт реализации mxl
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "АктОказанныхУслуг";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Акт оказанных услуг'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 

	// Акт реализации docx
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "УправлениеПечатью";
	КомандаПечати.Идентификатор = "Документ.РеализацияТоваровУслуг.ПФ_DOC_АктОказанияУслуг";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Акт оказания услуг (docx)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОказанныхУслуг");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАктОказанияУслуг(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт оказанных услуг'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОказанныхУслуг";
	КонецЕсли;
		
	
КонецПроцедуры  

// Формирует табличный документ печатной формы "Акт реализации"
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//
Функция ПечатьАктОказанияУслуг(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОказанныхУслуг";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОказанныхУслуг");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	Шапка = ДанныеДокументов.Выбрать();
	
	СписокПолей = "";
	Для Каждого Колонка Из ДанныеДокументов.Колонки Цикл
		СписокПолей = СписокПолей + ?(СписокПолей="","",",")+Колонка.Имя;
	КонецЦикла;
	
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		//Начало вывода документа
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
		ДанныеЗаполнения = Новый Структура(СписокПолей);
		ДанныеЗаполнения.Вставить("Номер",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.НомерДокумента,Истина,Истина));
		ДанныеЗаполнения.Вставить("Дата",Формат(Шапка.ДатаДокумента,"ДЛФ=DD"));
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения,Шапка);
		ОбластьШапка.Параметры.Заполнить(ДанныеЗаполнения);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ШапкаТаблицы);
		
		РезультатТовары = Шапка.Товары;
		РезультатУслуги = Шапка.Услуги;
		
		СписокПолейТовары = "";
		Для Каждого Колонка Из РезультатТовары.Колонки Цикл
			СписокПолейТовары = СписокПолейтовары + ?(СписокПолейТовары="","",",")+Колонка.Имя;
		КонецЦикла;  
		
		СписокПолейУслуги = "";
		Для Каждого Колонка Из РезультатУслуги.Колонки Цикл
			СписокПолейУслуги = СписокПолейУслуги + ?(СписокПолейУслуги="","",",")+Колонка.Имя;
		КонецЦикла;
		Сч = 0;
		Товары = РезультатТовары.Выбрать();
		Если Товары.Количество()> 0 Тогда
			Пока Товары.Следующий() Цикл
				Сч = Сч+1;
				СтрокаНоменклатура = Макет.ПолучитьОбласть("СтрокаНоменклатура");
				ДанныеЗаполненияТовары = Новый Структура(СписокПолейТовары);
				ДанныеЗаполненияТовары.Вставить("Номер", Сч) ;
				ЗаполнитьЗначенияСвойств(ДанныеЗаполненияТовары,Товары);
				СтрокаНоменклатура.Параметры.Заполнить(ДанныеЗаполненияТовары);
				ТабличныйДокумент.Вывести(СтрокаНоменклатура);
			КонецЦикла;	
		КонецЕсли;
		
		Услуги = РезультатУслуги.Выбрать();
		Если Услуги.Количество()> 0  Тогда
			Пока Услуги.Следующий() Цикл
				Сч = Сч+1;
				СтрокаНоменклатура = Макет.ПолучитьОбласть("СтрокаНоменклатура");
				ДанныеЗаполненияУслуги = Новый Структура(СписокПолейУслуги);
				ДанныеЗаполненияУслуги.Вставить("Номер", Сч) ;
				ЗаполнитьЗначенияСвойств(ДанныеЗаполненияУслуги,Услуги);
				СтрокаНоменклатура.Параметры.Заполнить(ДанныеЗаполненияУслуги);
				ТабличныйДокумент.Вывести(СтрокаНоменклатура);
			КонецЦикла;
		КонецЕсли;
		
		ОбщаяСуммаДокумента = Макет.ПолучитьОбласть("ОбщаяСуммаДокумента");
		ДанныеЗаполнения.Вставить("СуммаПрописью",ЧислоПрописью(Шапка.СуммаЦифрами,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
		ОбщаяСуммаДокумента.Параметры.Заполнить(ДанныеЗаполнения);
		ТабличныйДокумент.Вывести(ОбщаяСуммаДокумента);
		
		Комментарий = Макет.ПолучитьОбласть("Комментарий");
		Комментарий.Параметры.Заполнить(ДанныеЗаполнения);
		ТабличныйДокумент.Вывести(Комментарий);
		
		
		РезультатОрганизация = Шапка.Организация;
		Организация = РезультатОрганизация.Выбрать();
		
		Реквизиты = Макет.ПолучитьОбласть("Реквизиты");
		Если Организация.Следующий() Тогда 
			ДанныеЗаполнения.Вставить("ОрганизацияПредставление",Организация.ОрганизацияПредставление);
			ДанныеЗаполнения.Вставить("НачалоДействияДоговора",Формат(Шапка.НачалоДействия,"ДЛФ=DD"));
			ДанныеЗаполнения.Вставить("КонецДействияДоговора",Формат(Шапка.КонецДействия,"ДЛФ=DD"));
			Реквизиты.Параметры.Заполнить(ДанныеЗаполнения);
			ТабличныйДокумент.Вывести(Реквизиты);
		КонецЕсли;
		
		Подписи = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(Подписи);
		
		//Конец вывода документа
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьДанныеДокументов(МассивОбъектов)
	
	// Получаем запросом необходимые данные.
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номер КАК НомерДокумента,
	|	ТаблицаДокумента.Дата КАК ДатаДокумента,
	|	ТаблицаДокумента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ТаблицаДокумента.СуммаДокумента КАК СуммаЦифрами,
	|	ТаблицаДокумента.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	ТаблицаДокумента.Услуги.(
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги,
	|	ТаблицаДокумента.Комментарий КАК Комментарий,
	|	ТаблицаДокумента.Организация.Наименование КАК ОрганизацияНаименование,
	|	ТаблицаДокумента.Организация.ИНН КАК ОрганизацияИНН,
	|	ТаблицаДокумента.Организация.КПП КАК ОрганизацияКПП,
	|	ТаблицаДокумента.Договор.Ссылка КАК Договор,
	|	ТаблицаДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ТаблицаДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ТаблицаДокумента.Договор.ВКМ_НачалоДействия КАК НачалоДействия,
	|	ТаблицаДокумента.Договор.ВКМ_КонецДействия КАК КонецДействия,
	|	ТаблицаДокумента.Контрагент.Ссылка КАК КонтрагентСсылка,
	|	ТаблицаДокумента.Организация.КонтактнаяИнформация.(
	|		Представление КАК ОрганизацияПредставление
	|	) КАК Организация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции
#КонецОбласти

#КонецЕсли
